In [1]:
import pandas as pd

In [5]:
## Reading a csv:
df = pd.read_csv('/home/legacy/anaconda3/Data Science Master Class/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/example.csv')
# You can also use header=on to put abcd as the first row.

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
# Setting a specific column as an index:
df = pd.read_csv('/home/legacy/anaconda3/Data Science Master Class/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/example.csv', index_col=0)

In [11]:
# Save Dataframe as .csv:
df.to_csv('/home/legacy/anaconda3/Data Science Master Class/Pandas/saved_csv.csv')

In [12]:
## Reading an HTML table:
url = 'https://en.wikipedia.org/wiki/World_population'

In [13]:
tables = pd.read_html(url)

In [16]:
len(tables)

26

In [20]:
pop_by_region = tables[1]

In [21]:
tables[1].columns

Index(['Region', 'Density(inhabitants/km2)', 'Population(millions)',
       'Most populous country', 'Most populous city (metropolitan area)'],
      dtype='object')

In [22]:
pop_by_region

,Region,Density(inhabitants/km2),Population(millions),Most populous country,Most populous city (metropolitan area)
0,Asia,104.1,4641,"1,411,778,000[note 1] – China","37,400,000/13,515,000 – Greater Tokyo Area/Tok..."
1,Africa,44.4,1340,"0211,401,000 – Nigeria","20,076,000/9,500,000 – Greater Cairo/Cairo"
2,Europe,73.4,747,"0146,171,000 – Russia;approx. 110 million in E...","20,004,000/13,200,000 – Moscow metropolitan ar..."
3,Latin America,24.1,653,"0214,103,000 – Brazil","21,650,000/12,252,000 – São Paulo Metro Area/S..."
4,Northern America[note 2],14.9,368,"0332,909,000 – United States","18,819,000/8,804,000 – New York metropolitan a..."
5,Oceania,5,42,"0025,917,000 – Australia","5,367,000 – Sydney"
6,Antarctica,~0,0.004[17],N/A[note 3],"1,258 – McMurdo Station"

## Excel
Pandas treats Excel files as a dictionary, where the keys are the sheets and the values are the dataframes in the excel sheets

In [26]:
df = pd.read_excel('/home/legacy/anaconda3/Data Science Master Class/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/my_excel_file.xlsx', sheet_name='First_Sheet')

In [27]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [36]:
# Read all the sheets and create a dictionary:
excel_sheet_dict = pd.read_excel('/home/legacy/anaconda3/Data Science Master Class/UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/my_excel_file.xlsx', sheet_name=None)

In [38]:
our_df = excel_sheet_dict

In [44]:
df.to_excel('/home/legacy/anaconda3/Data Science Master Class/excel_written1.xlsx') # Probably you will not want to save the excel file with the default pandas index, so take that into account

In [45]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## SQL
sqlalchemy library is used

Step 1: Figure out which SQL engine you are going to use (PostgreSQL, MySQL, MS SQL Server)
Step 2: Install the appropiate python library for you SQL
Step 3: Use the sqlalchemy library to connect with you SQL database with the driver
Step 4: Use the sqlalchemy driver connection with pandas read_sql method. Pandas can read entire tables as DataFrames, or you can juse your SQL skills previously and only select a chunk of data in which you are interested on.

In [49]:
from sqlalchemy import create_engine
import numpy as np

In [50]:
temp_db = create_engine('sqlite:///:memory:') # Creates temporary database allocated in the RAM

In [53]:
pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)),columns=['a', 'b', 'c', 'd'])

    a   b   c   d
0  98  55  89  61
1  41  82  70   6
2  20  49  55  14
3  82  18  98   9

In [55]:
df.to_sql(name='new_table',con=temp_db) # It is only run once because for the second time, new_table will already exist, thus, it will show an erro
# This way you don't take the risk of accidentally overwriting your whole SQL database.

ValueError: Table 'new_table' already exists.